S1Сtest/src/Documents/ЗаявлениеНаПредоставлениеГосуслуги/ЗаявлениеНаПредоставлениеГосуслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявлениеНаПредоставлениеГосуслуги</name>
  <attributes>
    <name>ГосУслуга</name>
    <type>
      <types>CatalogRef.ГосУслуги</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналПоступленияЗаявления</name>
    <type>
      <types>CatalogRef.КаналыПоступленияЗаявлений</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателя</name>
    <type>
      <types>EnumRef.КатегорияПолучателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоляЗаявления</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидПоляЗаявления</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоля</name>
      <type>
        <types>Characteristic.ВидПоляЗаявления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

S1Сtest/src/Enums/КатегорияПолучателя/КатегорияПолучателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорияПолучателя</name>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

S1Сtest/src/Catalogs/ГосУслуги/ГосУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГосУслуги</name>
  <attributes>
    <name>Ведомство</name>
    <type>
      <types>CatalogRef.Ведомства</types>
    </type>
  </attributes>
  <attributes>
    <name>КартаМаршрута</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииГосУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлатнаяУслуга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПошлины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Этапы</name>
    <attributes>
      <name>ВидЭтапа</name>
      <type>
        <types>EnumRef.ВидыЭтаповПредоставленияГосУслуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Ведомство</name>
      <type>
        <types>CatalogRef.Ведомства</types>
      </type>
    </attributes>
    <attributes>
      <name>СледующийЭтапУспех</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СледующийЭтапНеудача</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииПолучателей</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>EnumRef.КатегорияПолучателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоляЗаявления</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидПоляЗаявления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

S1Сtest/src/Documents/ЗаявлениеНаПредоставлениеГосуслуги/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОграничениеТипаПолучателя();
	УстановитьПоляЗаявления();
	
КонецПроцедуры

&НаКлиенте
Процедура ГосУслугаПриИзменении(Элемент)
	
	УстановитьОграничениеТипаПолучателя();
	УстановитьПоляЗаявления();
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияПолучателяПриИзменении(Элемент)
	УстановитьПоляЗаявления();
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеТипаПолучателя()
	
	МассивТипов = Новый Массив;
	СписокКатегорийПолучателя = Элементы.КатегорияПолучателя.СписокВыбора;
	СписокКатегорийПолучателя.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГосУслуга", Объект.ГосУслуга);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГосУслугиКатегорииПолучателей.Категория КАК Категория
	|ИЗ
	|	Справочник.ГосУслуги.КатегорииПолучателей КАК ГосУслугиКатегорииПолучателей
	|ГДЕ
	|	ГосУслугиКатегорииПолучателей.Ссылка = &ГосУслуга";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СписокКатегорийПолучателя.Добавить(Выборка.Категория);
		
		Если Выборка.Категория = Перечисления.КатегорияПолучателя.ФизическоеЛицо Тогда
			
			МассивТипов.Добавить(Тип("СправочникСсылка.ФизическиеЛица"));
			
		ИначеЕсли Выборка.Категория = Перечисления.КатегорияПолучателя.ЮридическоеЛицо Тогда
			
			МассивТипов.Добавить(Тип("СправочникСсылка.ЮридическиеЛица"));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов(МассивТипов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПоляЗаявления()
	
	ТаблицаПоляЗаявления = Объект.ПоляЗаявления.Выгрузить().СкопироватьКолонки();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГосУслуга", Объект.ГосУслуга);
	Запрос.УстановитьПараметр("Категория", Объект.КатегорияПолучателя);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГосУслугиПоляЗаявления.Поле КАК Поле
	|ИЗ
	|	Справочник.ГосУслуги.ПоляЗаявления КАК ГосУслугиПоляЗаявления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ВидПоляЗаявления КАК ВидПоляЗаявления
	|		ПО ГосУслугиПоляЗаявления.Поле = ВидПоляЗаявления.Ссылка
	|ГДЕ
	|	ГосУслугиПоляЗаявления.Ссылка = &ГосУслуга
	|	И (ВидПоляЗаявления.КатегорияПолучателя = &Категория
	|			ИЛИ ВидПоляЗаявления.КатегорияПолучателя = ЗНАЧЕНИЕ(Перечисление.КатегорияПолучателя.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	ГосУслугиПоляЗаявления.НомерСтроки";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = Объект.ПоляЗаявления.НайтиСтроки(Новый Структура("Поле", Выборка.Поле));
		
		СтрокаЗаявления = ТаблицаПоляЗаявления.Добавить();
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаЗаявления.Поле = Выборка.Поле;
		Иначе
			ЗаполнитьЗначенияСвойств(СтрокаЗаявления, НайденныеСтроки[0]);
		КонецЕсли;
		
	КонецЦикла;
	
	Объект.ПоляЗаявления.Загрузить(ТаблицаПоляЗаявления);
	
КонецПроцедуры
